IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM24_CONTROLSS_G3_EPWM24.xml
	<register id="CONTROLSS_G3_EPWM24_EPWMREV" acronym="CONTROLSS_G3_EPWM24_EPWMREV" offset="0x7C" width="16" description="EPWM Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x5" description="EPWM Type Bits: These bits specify the EPWM type. These bits are changed if the functionality of the EPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="EPWM Silicon Revision Bits: These bits specify the EPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM24_HRPWMREV" acronym="CONTROLSS_G3_EPWM24_HRPWMREV" offset="0x7E" width="16" description="High Resolution Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x3" description="HRPWM Type Bits: These bits specify the HRPWM type. These bits are changed if the functionality of the HRPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="HRPWM Silicon Revision Bits: These bits specify the HRPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM24_AQCTLA" acronym="CONTROLSS_G3_EPWM24_AQCTLA" offset="0x80" width="16" description="Action Qualifier Control Register For Output A ">
		<bitfield id="CBD" width="2" begin="11" end="10" resetval="0x0" description="Action When TBCTR = CMPB on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="CBU" width="2" begin="9" end="8" resetval="0x0" description="Action When TBCTR = CMPB on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CAD" width="2" begin="7" end="6" resetval="0x0" description="Action When TBCTR = CMPA on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CAU" width="2" begin="5" end="4" resetval="0x0" description="Action When TBCTR = CMPA on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRD" width="2" begin="3" end="2" resetval="0x0" description="Action When TBCTR = TBPRD  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="2" begin="1" end="0" resetval="0x0" description="Action When TBCTR = 0  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM24_AQCTLA2" acronym="CONTROLSS_G3_EPWM24_AQCTLA2" offset="0x82" width="16" description="Additional Action Qualifier Control Register For Output A ">
		<bitfield id="T2D" width="2" begin="7" end="6" resetval="0x0" description="Action when event occurs on T2 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="T2U" width="2" begin="5" end="4" resetval="0x0" description="Action when event occurs on T2 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="T1D" width="2" begin="3" end="2" resetval="0x0" description="Action when event occurs on T1 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="T1U" width="2" begin="1" end="0" resetval="0x0" description="Action when event occurs on T1 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
